{
  "translation": {
    "languages": {
      "available-languages": "Available languages",
      "en": "English",
      "et": "Estonian",
      "ru": "Russian"
    },
    "theme": {
      "light": "Light",
      "dark": "Dark",
      "system": "System",
      "toggle-theme": "Toggle theme"
    },
    "about-me": {
      "title": "About Me",
      "content": [
        "In today's world, there is no limit to what one can learn. With the vast amount of information available, it is possible to find answers to almost any question or to draw conclusions based on the available data.",
        "However, the key to success lies not only in acquiring knowledge but also in refining one's thought process. The better one becomes at learning, the more knowledge they can amass. By focusing on developing our ability to learn, we can unlock our full potential and achieve great things."
      ],
      "what-i-do": {
        "title": "What I do",
        "front-end": {
          "title": "Front End Development",
          "description": [
            "I focus on creating functional/responsive designs",
            "Frameworks that I use: React, Vue",
            "For styling I prefer to use tailwindcss or bootstrap -- I prefer not to write css"
          ]
        },
        "back-end": {
          "title": "Back End Development",
          "description": [
            "Personally I prefer backend -- using logic and manipulating data makes more sense to me",
            "Languages I've used for backend: JavaScript, TypeScript (node.js), C#, Java, PHP"
          ]
        },
        "mobile-development": {
          "title": "Mobile Application Development",
          "description": [
            "I have little experience with creating mobile applications using xamarin (C#)"
          ]
        },
        "database": {
          "title": "Database",
          "description": [
            "Working on the backend usually requires data to be stored as well",
            "So for data manipulation/storage I have become experienced with SQL (Postgres, Oracle, MySQL, SQLite)"
          ]
        },
        "dev-ops": {
          "title": "DevOps",
          "description": [
            "Automation is one of my core values -- I do not like repetitive tasks",
            "I have learned to create CI/CD pipelines to automate building and testing/linting code"
          ]
        },
        "server-management": {
          "title": "Server Management",
          "description": [
            "To host applications I've utilized my old pc as a server (RHEL based -- CentOS, AlmaLinux)",
            "I use it to host samba (SMB), ArchiSteamFarm, and some of my own applications (Discord Server Bot)"
          ]
        }
      },
      "languages-frameworks": "What I use"
    },
    "contact-page": {
      "title": "Contact",
      "contact-me": "Feel free to send me an e-mail"
    },
    "blog-page": {
      "title": "Blog"
    },
    "resume-page": {
      "title": "Resume",
      "experience": {
        "title": "Experience",
        "description": "My work experience"
      },
      "working-skills": "Working Skills",
      "knowledges": "Knowledges"
    },
    "work-page": {
      "title": "Work"
    },
    "footer": "View Source Code on",
    "404": {
      "title": "404 Page not found",
      "description": "The page you are trying to navigate to does not exist"
    },
    "work": {
      "positions": {
        "software-developer": "Software Developer",
        "full-stack-developer": "Full-Stack Developer"
      },
      "types": {
        "contract": "Contract",
        "full-time": "Full-Time",
        "internship": "Internship"
      },
      "descriptions": {
        "0": [
          "Developed website to show on TV with PHP, HTML, JavaScript\n",

          "Using Microsoft Power Automate and Microsoft Power apps",
          "I developed applications for generating work documents that:",
          "- employees can easily fill in and sign",
          "- input information gets formatted using a template (Word, Excel -- online variant)",
          "- if needed javascript is run on Excel to account for MS Power Apps/Power Automate online version limitations.",
          "- which then gets converted into a pdf"
        ],
        "1": [
          "Added a feature to to notify workers of events on my previously built website",
          "Made a desktop application that can be used to easily configure the config file"
        ],
        "2": [
          "Worked with Oracle database and PLSQL.\n",

          "Developed a new version of intranet using Nuxt.js\n",

          "Created a new interface for inputting data (frontend), generic system for data validation (backend).\n",

          "Created a python script that generates html and javascript content that can be used in the backend (PHP) to serve serve content.",
          "Essentially a way to:",
          "- quickly develop how the frontend would look like",
          "- ensure coupled systems work together (id for an element can be in one place and will propagate to HTML, JavaScript)"
        ],
        "3": [
          "Managing a Package Manager/Server Updater project that (Java, Delphi, React):",
          "- Makes sure customer packages are up to date -- Auto Deployment",
          "- Installation of packages along with conflict resolution, dependancy management",

          "\nWorking on intranet (written in Delphi, HTML, JavaScript) which is used for:",
          "- package management -- compilation, hotfixes, source overview, auto deployment",
          "- customer management -- customer services, licencing",
          "- employee tools -- tasks, roles, permissions, vacations, timeclock",
          "- statistics -- various statistics that help to manage/know the state of things",

          "\nWorking on other projects where my expertise has been needed:",
          "- Single Sign On project",
          "- - communication layer between auth0 and raintree (deployed on AWS)",
          "- - frontend -- liquid templating language, html, javascript",

          "\nPython script that creates a folder to store all information related to task -- to better organize tasks:",
          "- intranet task url, jira task url",
          "- readme template",
          "- vsc workspace folders that is related to ask",

          "\nHouse App that uses Nuxt.js (TypeScript, vue, nitro). Used to:",
          "- view front/back door cameras",
          "- open door",
          "- view where people are located at"
        ]
      }
    },
    "education": {
      "title": "Education",
      "description": "My academic journey",
      "type": {
        "vocational": "Vocational education",
        "secondary": "Secondary education"
      },
      "MHG_description": "Nature Orientation",
      "TPT_description": "Software Development"
    },
    "till-now": "till now"
  },
  "common": {
    "forms": {
      "subject": "subject",
      "body": "body",
      "send-email": "Send Email",
      "send-email-tooltip": "This forwards you to your systems e-mail application"
    },
    "download-cv": "Download CV",
    "see-more": "see more",
    "see-less": "see less",
    "see-more-on": "See more on"
  }
}
